-- Лабораторна робота №2
-- студентки групи КН-31 підгрупа 1
-- Гринішак Інни

-- Мета: Набути досвiду визначення рекурсивних функцiй, використання механiзму
-- зiставлення зi зразком i роботи з кортежами та списками.

-- Варіант 5


-- Завдання 1. 
-- 5) Чи є список палiндромом?

-- а) без застосування вбудованих функцiй :

isPal_1 ::(Eq a) => [a] -> Bool
isPal_1 x = x == rev x

rev [] = [] 
rev (x:xs) = rev xs ++ [x]

-- b) із застосуванням вбудованих функцiй :

isPal_2 ::(Eq a) => [a] -> Bool
isPal_2 x = x == reverse x


-- Завдання 2.
-- 5) Об’єднання зi змiшуванням двох спискiв довжиною n1 та n2. 
-- Вихiдний список має довжину 2 ∗ n, де n = min(n1, n2). 
-- Наприклад "abcde"та "123"перетворюються на "a1b2c3". 

-- а) без застосування вбудованих функцiй :

union_1 :: (Eq a) => [a] -> [a] -> [a]
union_1 [] [] = []
union_1 [] (x:xs) = []
union_1 (x:xs) [] = []

union_1 (x:xs) (y:ys) = [x] ++ [y] ++ union_1 xs ys

-- b) із застосуванням вбудованих функцiй :

union_2 :: (Eq a) => [a] -> [a] -> [a]
union_2 [] [] = []
union_2 [] x = []
union_2 x [] = []

union_2 x y = [head x] ++ [head y] ++ union_2 (tail x) (tail y)


-- Висновок: в ході лабораторної роботи я набула досвiду визначення рекурсивних функцiй, 
-- використання механiзму зiставлення зi зразком i роботи з кортежами та списками. 
-- Також розібралась з вбудованими функціями та навчилась писати свої.