-- Лабораторна робота №3
-- студентки групи КН-31 підгрупи 1
-- Гринішак Інни

-- Мета: Набути досвiду визначення та використання функцiй вищого порядку.

-- Варіант 5


-- Завдання 1. 
-- 5) Визначити довжину послiдовностi тотожних елементiв списку, напр.:
-- "aaabbcaadddd"⇒ [(’a’,3), (’b’,2), (’c’,1), (’a’,2), (’d’,4)].

-- а) із застосуванням вбудованих функцiй :

import Data.List

len_elem1 [] = []
len_elem1 (x:xs) = (x, length $ x: takeWhile (==x) xs)
                 : len_elem1 (dropWhile (==x) xs)

-- "oooaddndd" ⇒ [(’o’,3), (’a’,1), (’d’,2), (’n’,1), (’d’,2)]

-- b) без застосування вбудованих функцiй :

len_elem2 :: Eq a => [a] -> [(a, Int)]
len_elem2 xs=zip h (map length l) where
    h = map head l 
    l = (group xs)

-- "aaabbcaadddd"⇒ [(’a’,3), (’b’,2), (’c’,1), (’a’,2), (’d’,4)]

-- Завдання 2.
-- 5) Знайти найбiльший спiльний дiльник двох чисел. 

-- а) з застосуванням вбудованих функцiй :

lcd1 a b = maximum(filter (nacilo a b) [1..a])
nacilo a b c = if mod a c == 0 && mod b c == 0 then True else False

-- (28, 42) ⇒ 14

-- b) без застосування вбудованих функцiй :

lcd2 0 b = b
lcd2 a b = if a>b then lcd2 (a-b) b
                  else lcd2 (b-a) a

-- (28, 42) ⇒ 14

-- Висновок: в ході лабораторної роботи я набула досвiду визначення та 
-- використання функцiй вищого порядку. Також розібралась із вбудованими функціями.